IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_RDBRST_STARTADDR" width="32" offset="0x24" internal="0" description="Read Burst/Compare Start Address Register">
        <bitfield id="START_ADDRESS" description="Start Address of Burst Operation" begin="20" end="0" width="21" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_RDBRST_LEN" width="32" offset="0x28" internal="0" description="Read Burst/Compare Length Register">
        <bitfield id="BURST_LENGTH" description="Length of Burst Operation" begin="20" end="0" width="21" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_RDBRST_FAILADDR" width="32" offset="0x3C" internal="0" description="Read Burst/Compare Fail Address Register">
        <bitfield id="FAIL_ADDRESS" description="Reflects address of last failed compare" begin="20" end="0" width="21" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_RDBRST_FAILCNT" width="32" offset="0x40" internal="0" description="Read Burst/Compare Fail Count Register">
        <bitfield id="FAIL_COUNT" description="Number of failures encountered in burst operation" begin="16" end="0" width="17" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_PRG_CTLSTAT" width="32" offset="0x50" internal="0" description="Program Control and Status Register">
        <bitfield id="ENABLE" description="Master control for all word program operations" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ENABLE_0" value="0x0" description="Word program operation disabled"/>
            <bitenum id="ENABLE_1" value="0x1" description="Word program operation enabled"/>
        </bitfield>
        <bitfield id="MODE" description="Write mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="MODE_0" value="0x0" description="Write immediate mode. Starts program operation immediately on each write to the Flash"/>
            <bitenum id="MODE_1" value="0x1" description="Full word write mode. Flash controller collates data over multiple writes to compose the full 128bit word before initiating the program operation"/>
        </bitfield>
        <bitfield id="VER_PRE" description="Controls automatic pre program verify operations" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="VER_PRE_0" value="0x0" description="No pre program verification"/>
            <bitenum id="VER_PRE_1" value="0x1" description="Pre verify feature automatically invoked for each write operation (irrespective of the mode)"/>
        </bitfield>
        <bitfield id="VER_PST" description="Controls automatic post program verify operations" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="VER_PST_0" value="0x0" description="No post program verification"/>
            <bitenum id="VER_PST_1" value="0x1" description="Post verify feature automatically invoked for each write operation (irrespective of the mode)"/>
        </bitfield>
        <bitfield id="STATUS" description="Status of program operations in the Flash memory" begin="17" end="16" width="2" rwaccess="R">
            <bitenum id="STATUS_0" value="0x0" description="Idle (no program operation currently active)"/>
            <bitenum id="STATUS_1" value="0x1" description="Single word program operation triggered, but pending"/>
            <bitenum id="STATUS_2" value="0x2" description="Single word program in progress"/>
            <bitenum id="STATUS_3" value="0x3" description="Reserved (Idle)"/>
        </bitfield>
        <bitfield id="BNK_ACT" description="Bank active" begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="BNK_ACT_0" value="0x0" description="Word in Bank0 being programmed"/>
            <bitenum id="BNK_ACT_1" value="0x1" description="Word in Bank1 being programmed"/>
        </bitfield>
    </register>
    <register id="FLCTL_PRGBRST_CTLSTAT" width="32" offset="0x54" internal="0" description="Program Burst Control and Status Register">
        <bitfield id="START" description="Trigger start of burst program operation" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TYPE" description="Type of memory that burst program is carried out on" begin="2" end="1" width="2" rwaccess="R/W">
            <bitenum id="TYPE_0" value="0x0" description="Main Memory"/>
            <bitenum id="TYPE_1" value="0x1" description="Information Memory"/>
            <bitenum id="TYPE_2" value="0x2" description="Reserved"/>
        </bitfield>
        <bitfield id="LEN" description="Length of burst" begin="5" end="3" width="3" rwaccess="R/W">
            <bitenum id="LEN_0" value="0x0" description="No burst operation"/>
            <bitenum id="LEN_1" value="0x1" description="1 word burst of 128 bits, starting with address in the FLCTL_PRGBRST_STARTADDR Register"/>
            <bitenum id="LEN_2" value="0x2" description="2*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register"/>
            <bitenum id="LEN_3" value="0x3" description="3*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register"/>
            <bitenum id="LEN_4" value="0x4" description="4*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register"/>
        </bitfield>
        <bitfield id="AUTO_PRE" description="Auto-Verify operation before the Burst Program" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="AUTO_PRE_0" value="0x0" description="No program verify operations carried out"/>
            <bitenum id="AUTO_PRE_1" value="0x1" description="Causes an automatic Burst Program Verify after the Burst Program Operation"/>
        </bitfield>
        <bitfield id="AUTO_PST" description="Auto-Verify operation after the Burst Program" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="AUTO_PST_0" value="0x0" description="No program verify operations carried out"/>
            <bitenum id="AUTO_PST_1" value="0x1" description="Causes an automatic Burst Program Verify before the Burst Program Operation"/>
        </bitfield>
        <bitfield id="BURST_STATUS" description="Status of a Burst Operation" begin="18" end="16" width="3" rwaccess="R">
            <bitenum id="BURST_STATUS_0" value="0x0" description="Idle (Burst not active)"/>
            <bitenum id="BURST_STATUS_1" value="0x1" description="Burst program started but pending"/>
            <bitenum id="BURST_STATUS_2" value="0x2" description="Burst active, with 1st 128 bit word being written into Flash"/>
            <bitenum id="BURST_STATUS_3" value="0x3" description="Burst active, with 2nd 128 bit word being written into Flash"/>
            <bitenum id="BURST_STATUS_4" value="0x4" description="Burst active, with 3rd 128 bit word being written into Flash"/>
            <bitenum id="BURST_STATUS_5" value="0x5" description="Burst active, with 4th 128 bit word being written into Flash"/>
            <bitenum id="BURST_STATUS_6" value="0x6" description="Reserved (Idle)"/>
            <bitenum id="BURST_STATUS_7" value="0x7" description="Burst Complete (status of completed burst remains in this state unless explicitly cleared by SW)"/>
        </bitfield>
        <bitfield id="PRE_ERR" description="Burst Operation encountered preprogram auto-verify errors" begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PST_ERR" description="Burst Operation encountered postprogram auto-verify errors" begin="20" end="20" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADDR_ERR" description="Burst Operation was terminated due to attempted program of reserved memory" begin="21" end="21" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CLR_STAT" description="Clear status bits 21-16 of this register" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
    </register>
