IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_PRGBRST_STARTADDR" width="32" offset="0x58" internal="0" description="Program Burst Start Address Register">
        <bitfield id="START_ADDRESS" description="Start Address of Program Burst Operation" begin="21" end="0" width="22" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_PRGBRST_DATA0_0" width="32" offset="0x60" internal="0" description="Program Burst Data0 Register0">
    </register>
    <register id="FLCTL_PRGBRST_DATA0_1" width="32" offset="0x64" internal="0" description="Program Burst Data0 Register1">
    </register>
    <register id="FLCTL_PRGBRST_DATA0_2" width="32" offset="0x68" internal="0" description="Program Burst Data0 Register2">
    </register>
    <register id="FLCTL_PRGBRST_DATA0_3" width="32" offset="0x6C" internal="0" description="Program Burst Data0 Register3">
    </register>
    <register id="FLCTL_PRGBRST_DATA1_0" width="32" offset="0x70" internal="0" description="Program Burst Data1 Register0">
    </register>
    <register id="FLCTL_PRGBRST_DATA1_1" width="32" offset="0x74" internal="0" description="Program Burst Data1 Register1">
    </register>
    <register id="FLCTL_PRGBRST_DATA1_2" width="32" offset="0x78" internal="0" description="Program Burst Data1 Register2">
    </register>
    <register id="FLCTL_PRGBRST_DATA1_3" width="32" offset="0x7C" internal="0" description="Program Burst Data1 Register3">
    </register>
    <register id="FLCTL_PRGBRST_DATA2_0" width="32" offset="0x80" internal="0" description="Program Burst Data2 Register0">
    </register>
    <register id="FLCTL_PRGBRST_DATA2_1" width="32" offset="0x84" internal="0" description="Program Burst Data2 Register1">
    </register>
    <register id="FLCTL_PRGBRST_DATA2_2" width="32" offset="0x88" internal="0" description="Program Burst Data2 Register2">
    </register>
    <register id="FLCTL_PRGBRST_DATA2_3" width="32" offset="0x8C" internal="0" description="Program Burst Data2 Register3">
    </register>
    <register id="FLCTL_PRGBRST_DATA3_0" width="32" offset="0x90" internal="0" description="Program Burst Data3 Register0">
    </register>
    <register id="FLCTL_PRGBRST_DATA3_1" width="32" offset="0x94" internal="0" description="Program Burst Data3 Register1">
    </register>
    <register id="FLCTL_PRGBRST_DATA3_2" width="32" offset="0x98" internal="0" description="Program Burst Data3 Register2">
    </register>
    <register id="FLCTL_PRGBRST_DATA3_3" width="32" offset="0x9C" internal="0" description="Program Burst Data3 Register3">
    </register>
    <register id="FLCTL_ERASE_CTLSTAT" width="32" offset="0xA0" internal="0" description="Erase Control and Status Register">
        <bitfield id="START" description="Start of Erase operation" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MODE" description="Erase mode selected by application" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SECTOR" value="0x0" description="Sector Erase (controlled by FLTCTL_ERASE_SECTADDR)"/>
            <bitenum id="MASS" value="0x1" description="Mass Erase (includes all Main and Information memory sectors that don't have corresponding WE bits set)"/>
        </bitfield>
        <bitfield id="TYPE" description="Type of memory that erase operation is carried out on" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="TYPE_0" value="0x0" description="Main Memory"/>
            <bitenum id="TYPE_1" value="0x1" description="Information Memory"/>
            <bitenum id="TYPE_2" value="0x2" description="Reserved"/>
        </bitfield>
        <bitfield id="STATUS" description="Status of erase operations in the Flash memory" begin="17" end="16" width="2" rwaccess="R">
            <bitenum id="STATUS_0" value="0x0" description="Idle (no program operation currently active)"/>
            <bitenum id="STATUS_1" value="0x1" description="Erase operation triggered to START but pending"/>
            <bitenum id="STATUS_2" value="0x2" description="Erase operation in progress"/>
            <bitenum id="STATUS_3" value="0x3" description="Erase operation completed (status of completed erase remains in this state unless explicitly cleared by SW)"/>
        </bitfield>
        <bitfield id="ADDR_ERR" description="Erase Operation was terminated due to attempted erase of reserved memory address" begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CLR_STAT" description="Clear status bits 18-16 of this register" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_ERASE_SECTADDR" width="32" offset="0xA4" internal="0" description="Erase Sector Address Register">
        <bitfield id="SECT_ADDRESS" description="Address of Sector being Erased" begin="21" end="0" width="22" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_INFO_WEPROT" width="32" offset="0xB0" internal="0" description="Information Memory Bank0 Write/Erase Protection Register">
        <bitfield id="PROT0" description="Protects Sector 0 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT1" description="Protects Sector 1 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT2" description="Protects Sector 2 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT3" description="Protects Sector 3 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT" width="32" offset="0xB4" internal="0" description="Main Memory Bank0 Write/Erase Protection Register">
        <bitfield id="PROT0" description="Protects Sector 0 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT1" description="Protects Sector 1 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT2" description="Protects Sector 2 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT3" description="Protects Sector 3 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT4" description="Protects Sector 4 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT5" description="Protects Sector 5 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT6" description="Protects Sector 6 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT7" description="Protects Sector 7 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT8" description="Protects Sector 8 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT9" description="Protects Sector 9 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT10" description="Protects Sector 10 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT11" description="Protects Sector 11 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT12" description="Protects Sector 12 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT13" description="Protects Sector 13 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT14" description="Protects Sector 14 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT15" description="Protects Sector 15 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT16" description="Protects Sector 16 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT17" description="Protects Sector 17 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT18" description="Protects Sector 18 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT19" description="Protects Sector 19 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT20" description="Protects Sector 20 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT21" description="Protects Sector 21 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT22" description="Protects Sector 22 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT23" description="Protects Sector 23 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT24" description="Protects Sector 24 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT25" description="Protects Sector 25 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT26" description="Protects Sector 26 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT27" description="Protects Sector 27 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT28" description="Protects Sector 28 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT29" description="Protects Sector 29 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT30" description="Protects Sector 30 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT31" description="Protects Sector 31 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK1_INFO_WEPROT" width="32" offset="0xC0" internal="0" description="Information Memory Bank1 Write/Erase Protection Register">
        <bitfield id="PROT0" description="Protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT1" description="Protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT2" description="Protects Sector 2 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT3" description="Protects Sector 3 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
