IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_BMRK_IFETCH" width="32" offset="0xD4" internal="0" description="Benchmark Instruction Fetch Count Register">
    </register>
    <register id="FLCTL_BMRK_DREAD" width="32" offset="0xD8" internal="0" description="Benchmark Data Read Count Register">
    </register>
    <register id="FLCTL_BMRK_CMP" width="32" offset="0xDC" internal="0" description="Benchmark Count Compare Register">
    </register>
    <register id="FLCTL_IFG" width="32" offset="0xF0" internal="0" description="Interrupt Flag Register">
        <bitfield id="RDBRST" description="If set to 1, indicates that the Read Burst/Compare operation is complete" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="AVPRE" description="If set to 1, indicates that the pre-program verify operation has detected an error" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="AVPST" description="If set to 1, indicates that the post-program verify operation has failed comparison" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PRG" description="If set to 1, indicates that a word Program operation is complete" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PRGB" description="If set to 1, indicates that the configured Burst Program operation is complete" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ERASE" description="If set to 1, indicates that the Erase operation is complete" begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BMRK" description="If set to 1, indicates that a Benchmark Compare match occurred" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PRG_ERR" description="If set to 1, indicates a word composition error in full word write mode (possible data loss due to writes crossing over to a new 128bit boundary before full word has been composed)" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_IE" width="32" offset="0xF4" internal="0" description="Interrupt Enable Register">
        <bitfield id="RDBRST" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPRE" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPST" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRGB" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ERASE" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BMRK" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG_ERR" description="If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_CLRIFG" width="32" offset="0xF8" internal="0" description="Clear Interrupt Flag Register">
        <bitfield id="RDBRST" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPRE" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPST" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRGB" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ERASE" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BMRK" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG_ERR" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_SETIFG" width="32" offset="0xFC" internal="0" description="Set Interrupt Flag Register">
        <bitfield id="RDBRST" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPRE" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="AVPST" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRGB" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ERASE" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BMRK" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRG_ERR" description="Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_READ_TIMCTL" width="32" offset="0x100" internal="0" description="Read Timing Control Register">
        <bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="IREF_BOOST1" description="Length of the IREF_BOOST1 signal of the IP" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="SETUP_LONG" description="Length of the Setup time into read mode when the device is recovering from one of the following conditions: Moving from Power-down or Standby back to Active and device is not trimmed. Moving from standby to active state in low-frequency active mode. Recovering from the LDO Boost operation after a Mass Erase." begin="23" end="16" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_READMARGIN_TIMCTL" width="32" offset="0x104" internal="0" description="Read Margin Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_PRGVER_TIMCTL" width="32" offset="0x108" internal="0" description="Program Verify Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="HOLD" description="Length of the Hold phase for this operation" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_ERSVER_TIMCTL" width="32" offset="0x10C" internal="0" description="Erase Verify Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_LKGVER_TIMCTL" width="32" offset="0x110" internal="0" description="Leakage Verify Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
