IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_PROGRAM_TIMCTL" width="32" offset="0x114" internal="0" description="Program Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
        <bitfield id="HOLD" description="Length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_ERASE_TIMCTL" width="32" offset="0x118" internal="0" description="Erase Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
        <bitfield id="HOLD" description="Length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_MASSERASE_TIMCTL" width="32" offset="0x11C" internal="0" description="Mass Erase Timing Control Register">
        <bitfield id="BOOST_ACTIVE" description="Length of the time for which LDO Boost Signal is kept active" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="BOOST_HOLD" description="Length for which Flash deactivates the LDO Boost signal before processing any new commands" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_BURSTPRG_TIMCTL" width="32" offset="0x120" internal="0" description="Burst Program Timing Control Register">
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT0" width="32" offset="0x200" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 0">
        <bitfield id="PROT0" description="Protects Sector 0 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT1" description="Protects Sector 1 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT2" description="Protects Sector 2 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT3" description="Protects Sector 3 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT4" description="Protects Sector 4 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT5" description="Protects Sector 5 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT6" description="Protects Sector 6 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT7" description="Protects Sector 7 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT8" description="Protects Sector 8 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT9" description="Protects Sector 9 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT10" description="Protects Sector 10 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT11" description="Protects Sector 11 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT12" description="Protects Sector 12 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT13" description="Protects Sector 13 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT14" description="Protects Sector 14 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT15" description="Protects Sector 15 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT16" description="Protects Sector 16 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT17" description="Protects Sector 17 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT18" description="Protects Sector 18 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT19" description="Protects Sector 19 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT20" description="Protects Sector 20 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT21" description="Protects Sector 21 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT22" description="Protects Sector 22 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT23" description="Protects Sector 23 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT24" description="Protects Sector 24 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT25" description="Protects Sector 25 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT26" description="Protects Sector 26 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT27" description="Protects Sector 27 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT28" description="Protects Sector 28 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT29" description="Protects Sector 29 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT30" description="Protects Sector 30 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT31" description="Protects Sector 31 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT1" width="32" offset="0x204" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 1">
        <bitfield id="PROT32" description="Protects Sector 32 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT33" description="Protects Sector 33 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT34" description="Protects Sector 34 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT35" description="Protects Sector 35 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT36" description="Protects Sector 36 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT37" description="Protects Sector 37 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT38" description="Protects Sector 38 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT39" description="Protects Sector 39 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT40" description="Protects Sector 40 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT41" description="Protects Sector 41 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT42" description="Protects Sector 42 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT43" description="Protects Sector 43 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT44" description="Protects Sector 44 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT45" description="Protects Sector 45 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT46" description="Protects Sector 46 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT47" description="Protects Sector 47 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT48" description="Protects Sector 48 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT49" description="Protects Sector 49 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT50" description="Protects Sector 50 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT51" description="Protects Sector 51 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT52" description="Protects Sector 52 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT53" description="Protects Sector 53 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT54" description="Protects Sector 54 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT55" description="Protects Sector 55 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT56" description="Protects Sector 56 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT57" description="Protects Sector 57 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT58" description="Protects Sector 58 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT59" description="Protects Sector 59 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT60" description="Protects Sector 60 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT61" description="Protects Sector 61 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT62" description="Protects Sector 62 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT63" description="Protects Sector 63 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT2" width="32" offset="0x208" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 2">
        <bitfield id="PROT64" description="Protects Sector 64 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT65" description="Protects Sector 65 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT66" description="Protects Sector 66 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT67" description="Protects Sector 67 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT68" description="Protects Sector 68 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT69" description="Protects Sector 69 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT70" description="Protects Sector 70 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT71" description="Protects Sector 71 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT72" description="Protects Sector 72 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT73" description="Protects Sector 73 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT74" description="Protects Sector 74 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT75" description="Protects Sector 75 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT76" description="Protects Sector 76 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT77" description="Protects Sector 77 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT78" description="Protects Sector 78 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT79" description="Protects Sector 79 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT80" description="Protects Sector 80 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT81" description="Protects Sector 81 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT82" description="Protects Sector 82 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT83" description="Protects Sector 83 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT84" description="Protects Sector 84 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT85" description="Protects Sector 85 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT86" description="Protects Sector 86 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT87" description="Protects Sector 87 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT88" description="Protects Sector 88 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT89" description="Protects Sector 89 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT90" description="Protects Sector 90 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT91" description="Protects Sector 91 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT92" description="Protects Sector 92 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT93" description="Protects Sector 93 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT94" description="Protects Sector 94 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT95" description="Protects Sector 95 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT3" width="32" offset="0x20C" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 3">
        <bitfield id="PROT96" description="Protects Sector 96 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT97" description="Protects Sector 97 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT98" description="Protects Sector 98 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT99" description="Protects Sector 99 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT100" description="Protects Sector 100 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT101" description="Protects Sector 101 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT102" description="Protects Sector 102 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT103" description="Protects Sector 103 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT104" description="Protects Sector 104 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT105" description="Protects Sector 105 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT106" description="Protects Sector 106 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT107" description="Protects Sector 107 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT108" description="Protects Sector 108 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT109" description="Protects Sector 109 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT110" description="Protects Sector 110 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT111" description="Protects Sector 111 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT112" description="Protects Sector 112 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT113" description="Protects Sector 113 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT114" description="Protects Sector 114 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT115" description="Protects Sector 115 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT116" description="Protects Sector 116 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT117" description="Protects Sector 117 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT118" description="Protects Sector 118 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT119" description="Protects Sector 119 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT120" description="Protects Sector 120 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT121" description="Protects Sector 121 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT122" description="Protects Sector 122 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT123" description="Protects Sector 123 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT124" description="Protects Sector 124 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT125" description="Protects Sector 125 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT126" description="Protects Sector 126 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT127" description="Protects Sector 127 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
