IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_BANK0_MAIN_WEPROT4" width="32" offset="0x210" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 4">
        <bitfield id="PROT128" description="Protects Sector 128 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT129" description="Protects Sector 129 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT130" description="Protects Sector 130 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT131" description="Protects Sector 131 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT132" description="Protects Sector 132 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT133" description="Protects Sector 133 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT134" description="Protects Sector 134 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT135" description="Protects Sector 135 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT136" description="Protects Sector 136 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT137" description="Protects Sector 137 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT138" description="Protects Sector 138 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT139" description="Protects Sector 139 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT140" description="Protects Sector 140 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT141" description="Protects Sector 141 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT142" description="Protects Sector 142 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT143" description="Protects Sector 143 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT144" description="Protects Sector 144 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT145" description="Protects Sector 145 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT146" description="Protects Sector 146 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT147" description="Protects Sector 147 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT148" description="Protects Sector 148 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT149" description="Protects Sector 149 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT150" description="Protects Sector 150 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT151" description="Protects Sector 151 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT152" description="Protects Sector 152 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT153" description="Protects Sector 153 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT154" description="Protects Sector 154 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT155" description="Protects Sector 155 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT156" description="Protects Sector 156 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT157" description="Protects Sector 157 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT158" description="Protects Sector 158 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT159" description="Protects Sector 159 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT5" width="32" offset="0x214" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 5">
        <bitfield id="PROT160" description="Protects Sector 160 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT161" description="Protects Sector 161 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT162" description="Protects Sector 162 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT163" description="Protects Sector 163 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT164" description="Protects Sector 164 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT165" description="Protects Sector 165 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT166" description="Protects Sector 166 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT167" description="Protects Sector 167 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT168" description="Protects Sector 168 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT169" description="Protects Sector 169 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT170" description="Protects Sector 170 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT171" description="Protects Sector 171 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT172" description="Protects Sector 172 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT173" description="Protects Sector 173 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT174" description="Protects Sector 174 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT175" description="Protects Sector 175 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT176" description="Protects Sector 176 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT177" description="Protects Sector 177 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT178" description="Protects Sector 178 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT179" description="Protects Sector 179 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT180" description="Protects Sector 180 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT181" description="Protects Sector 181 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT182" description="Protects Sector 182 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT183" description="Protects Sector 183 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT184" description="Protects Sector 184 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT185" description="Protects Sector 185 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT186" description="Protects Sector 186 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT187" description="Protects Sector 187 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT188" description="Protects Sector 188 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT189" description="Protects Sector 189 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT190" description="Protects Sector 190 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT191" description="Protects Sector 191 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT6" width="32" offset="0x218" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 6">
        <bitfield id="PROT192" description="Protects Sector 192 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT193" description="Protects Sector 193 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT194" description="Protects Sector 194 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT195" description="Protects Sector 195 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT196" description="Protects Sector 196 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT197" description="Protects Sector 197 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT198" description="Protects Sector 198 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT199" description="Protects Sector 199 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT200" description="Protects Sector 200 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT201" description="Protects Sector 201 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT202" description="Protects Sector 202 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT203" description="Protects Sector 203 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT204" description="Protects Sector 204 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT205" description="Protects Sector 205 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT206" description="Protects Sector 206 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT207" description="Protects Sector 207 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT208" description="Protects Sector 208 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT209" description="Protects Sector 209 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT210" description="Protects Sector 210 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT211" description="Protects Sector 211 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT212" description="Protects Sector 212 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT213" description="Protects Sector 213 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT214" description="Protects Sector 214 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT215" description="Protects Sector 215 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT216" description="Protects Sector 216 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT217" description="Protects Sector 217 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT218" description="Protects Sector 218 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT219" description="Protects Sector 219 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT220" description="Protects Sector 220 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT221" description="Protects Sector 221 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT222" description="Protects Sector 222 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT223" description="Protects Sector 223 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_MAIN_WEPROT7" width="32" offset="0x21C" internal="0" description="Main Memory Bank0 Write/Erase Protection Register 7">
        <bitfield id="PROT224" description="Protects Sector 224 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT225" description="Protects Sector 225 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT226" description="Protects Sector 226 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT227" description="Protects Sector 227 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT228" description="Protects Sector 228 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT229" description="Protects Sector 229 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT230" description="Protects Sector 230 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT231" description="Protects Sector 231 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT232" description="Protects Sector 232 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT233" description="Protects Sector 233 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT234" description="Protects Sector 234 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT235" description="Protects Sector 235 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT236" description="Protects Sector 236 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT237" description="Protects Sector 237 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT238" description="Protects Sector 238 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT239" description="Protects Sector 239 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT240" description="Protects Sector 240 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT241" description="Protects Sector 241 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT242" description="Protects Sector 242 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT243" description="Protects Sector 243 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT244" description="Protects Sector 244 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT245" description="Protects Sector 245 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT246" description="Protects Sector 246 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT247" description="Protects Sector 247 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT248" description="Protects Sector 248 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT249" description="Protects Sector 249 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT250" description="Protects Sector 250 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT251" description="Protects Sector 251 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT252" description="Protects Sector 252 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT253" description="Protects Sector 253 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT254" description="Protects Sector 254 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT255" description="Protects Sector 255 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
