IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/FLCTL_A_356.0.xml
    <register id="FLCTL_BANK1_MAIN_WEPROT7" width="32" offset="0x25C" internal="0" description="Main Memory Bank1 Write/Erase Protection Register 7">
        <bitfield id="PROT224" description="Protects Sector 224 from program or erase" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT225" description="Protects Sector 225 from program or erase" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT226" description="Protects Sector 226 from program or erase" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT227" description="Protects Sector 227 from program or erase" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT228" description="Protects Sector 228 from program or erase" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT229" description="Protects Sector 229 from program or erase" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT230" description="Protects Sector 230 from program or erase" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT231" description="Protects Sector 231 from program or erase" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT232" description="Protects Sector 232 from program or erase" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT233" description="Protects Sector 233 from program or erase" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT234" description="Protects Sector 234 from program or erase" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT235" description="Protects Sector 235 from program or erase" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT236" description="Protects Sector 236 from program or erase" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT237" description="Protects Sector 237 from program or erase" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT238" description="Protects Sector 238 from program or erase" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT239" description="Protects Sector 239 from program or erase" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT240" description="Protects Sector 240 from program or erase" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT241" description="Protects Sector 241 from program or erase" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT242" description="Protects Sector 242 from program or erase" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT243" description="Protects Sector 243 from program or erase" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT244" description="Protects Sector 244 from program or erase" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT245" description="Protects Sector 245 from program or erase" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT246" description="Protects Sector 246 from program or erase" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT247" description="Protects Sector 247 from program or erase" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT248" description="Protects Sector 248 from program or erase" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT249" description="Protects Sector 249 from program or erase" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT250" description="Protects Sector 250 from program or erase" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT251" description="Protects Sector 251 from program or erase" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT252" description="Protects Sector 252 from program or erase" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT253" description="Protects Sector 253 from program or erase" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT254" description="Protects Sector 254 from program or erase" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT255" description="Protects Sector 255 from program or erase" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
</module>
